app/controllers/articles_controller.rb

  def index
    if params[:search]
      @articles = Article.search(params[:search]).order("created_at DESC")
    else
      @articles = Article.all
---
SELECT "articles".* FROM "articles"